3A/SE350/Uniprocessor-Scheduling.org
#+title: Uniprocessor Scheduling
#+author: Arnav Gupta
#+LATEX_HEADER: \usepackage{parskip,darkmode}
#+LATEX_HEADER: \enabledarkmode

* Types of Processor Scheduling
*Long-term scheduling*: decision to add to the pool of processes to be executed

*Medium-term scheduling*: decision to add to the number of processes that are partially or
fully in main memory

*Short-term scheduling*: decision as to which available process will be executed by the
processor

*IO scheduling*: decision as to which process's pending IO request shall be handled by an
available IO device

The aim of processor scheduling is to assign processes to be executed by the processor or
processors over time, in a way that meets system objectives (response time, throughput,
processor efficiency).

Scheduling affect system performance since it determines which processes wait and which
progress.
Scheduling involves managing queues to minimize queueing delay and to optimize performance
in a queueing environment.

** Long-Term Scheduling
Controls the degree of multiprogramming since it determines which programs are admitted
to the system.

A newly created process can be added to a queue for a short-term scheduler (admitted)
or a medium-term scheduler (swapped-out).

Newly submitted jobs are routed to disk and held in a batch queue, which the long-term
scheduler creates processes from, based on 2 decisions:
1. when the OS can take on one or more additional processes
   - driven by the desired degree of multiprogramming
   - more processes created, smaller percentage of time each process can be executed
   - each time a job terminates, scheduler may add 1+ jobs
   - if the fraction of idle time exceeds a threshold, scheduler may be invoked
2. which job(s) to accept and turn into processes
   - can be based on first-come-first-serve or include priority, expected execution time,
     and IO requirements

For interactive programs in a time-sharing system, the OS accepts all users until the
system is saturated.

** Medium-Term Scheduling
Part of the swapping decision, based on memory requirements (memory management) and the
need to manage the degree of multiprogramming.

** Short-Term Scheduling
Executes most frequently, is invoked whenever an event occurs that may lead to the
blocking of the current process or provides an opportunity to preempt a currently
running process in favour of another.
Such events are:
- clock interrupts
- IO interrupts
- operating system calls
- signals (ex. semaphores)

* Scheduling Algorithms
** Short-Term Scheduling Criteria
*Objective*: allocate processor time to optimize 1+ aspects of system behaviour

*User-oriented criteria* relate to the behaviour of the system as perceived by a user
or process. (ex. response time - time between request submission and response output)
*System-oriented criteria* have the focus on effective and efficient processor
utilization. (ex. throughput - rate at which processes are completed)
User-oriented criteria always important, system-oriented criteria only important if
more than 1 user.

*Performance-related criteria* are quantitative and can be readily measured (response
time and throughput). *Other criteria* are qualitative or cannot be readily measured
(predictability).

Criteria are interdependent, cannot all be satisfied.

*** User-Oriented, Performance Related
*Turnaround time*: interval between submission of a process and completion (execution
time plus time spent waiting for resources

*Response time*: time from submission of a request and when the response is received
(request could still be being processed)

*Deadlines*: when process completion deadlines can be specified, scheduling should
maximize the percent of deadlines met

