3A/SE350/Uniprocessor-Scheduling.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-25 Mon 01:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Uniprocessor Scheduling</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Uniprocessor Scheduling</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org732690a">1. Types of Processor Scheduling</a>
<ul>
<li><a href="#org094f5fb">1.1. Long-Term Scheduling</a></li>
<li><a href="#org5a6f0bf">1.2. Medium-Term Scheduling</a></li>
<li><a href="#org105fb29">1.3. Short-Term Scheduling</a></li>
</ul>
</li>
<li><a href="#org4edd47f">2. Scheduling Algorithms</a>
<ul>
<li><a href="#orgf1cb131">2.1. Short-Term Scheduling Criteria</a>
<ul>
<li><a href="#org230955f">2.1.1. User-Oriented, Performance Related</a></li>
<li><a href="#orgb430b37">2.1.2. User-Oriented, Other</a></li>
<li><a href="#orgf4bd488">2.1.3. System-Oriented, Performance Related</a></li>
<li><a href="#org9ae71d5">2.1.4. System-Oriented, Other</a></li>
</ul>
</li>
<li><a href="#orgf641dcf">2.2. Use of Priorities</a></li>
<li><a href="#org468716d">2.3. Alternative Scheduling Policies</a>
<ul>
<li><a href="#org8c4c8af">2.3.1. First-Come-First-Served</a></li>
<li><a href="#org13b5895">2.3.2. Round Robin</a></li>
<li><a href="#orga808e86">2.3.3. Shortest Process Next</a></li>
<li><a href="#orga2c2a31">2.3.4. Shortest Remaining Time</a></li>
<li><a href="#org3b6f1e0">2.3.5. Higher Response Ratio Next</a></li>
<li><a href="#org3ac0ff5">2.3.6. Feedback</a></li>
</ul>
</li>
<li><a href="#orgef419cb">2.4. Performance Comparison</a>
<ul>
<li><a href="#orgc4f1b0c">2.4.1. Queueing Analysis</a></li>
<li><a href="#org2337b17">2.4.2. Simulation Modelling</a></li>
</ul>
</li>
<li><a href="#org5f84b59">2.5. Fair-Share Scheduling</a></li>
</ul>
</li>
<li><a href="#orgab57794">3. Traditional UNIX Scheduling</a></li>
</ul>
</div>
</div>
<div id="outline-container-org732690a" class="outline-2">
<h2 id="org732690a"><span class="section-number-2">1.</span> Types of Processor Scheduling</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Long-term scheduling</b>: decision to add to the pool of processes to be executed
</p>

<p>
<b>Medium-term scheduling</b>: decision to add to the number of processes that are partially or
fully in main memory
</p>

<p>
<b>Short-term scheduling</b>: decision as to which available process will be executed by the
processor
</p>

<p>
<b>IO scheduling</b>: decision as to which process&rsquo;s pending IO request shall be handled by an
available IO device
</p>

<p>
The aim of processor scheduling is to assign processes to be executed by the processor or
processors over time, in a way that meets system objectives (response time, throughput,
processor efficiency).
</p>

<p>
Scheduling affect system performance since it determines which processes wait and which
progress.
Scheduling involves managing queues to minimize queueing delay and to optimize performance
in a queueing environment.
</p>
</div>
<div id="outline-container-org094f5fb" class="outline-3">
<h3 id="org094f5fb"><span class="section-number-3">1.1.</span> Long-Term Scheduling</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Controls the degree of multiprogramming since it determines which programs are admitted
to the system.
</p>

<p>
A newly created process can be added to a queue for a short-term scheduler (admitted)
or a medium-term scheduler (swapped-out).
</p>

<p>
Newly submitted jobs are routed to disk and held in a batch queue, which the long-term
scheduler creates processes from, based on 2 decisions:
</p>
<ol class="org-ol">
<li>when the OS can take on one or more additional processes
<ul class="org-ul">
<li>driven by the desired degree of multiprogramming</li>
<li>more processes created, smaller percentage of time each process can be executed</li>
<li>each time a job terminates, scheduler may add 1+ jobs</li>
<li>if the fraction of idle time exceeds a threshold, scheduler may be invoked</li>
</ul></li>
<li>which job(s) to accept and turn into processes
<ul class="org-ul">
<li>can be based on first-come-first-serve or include priority, expected execution time,
and IO requirements</li>
</ul></li>
</ol>

<p>
For interactive programs in a time-sharing system, the OS accepts all users until the
system is saturated.
</p>
</div>
</div>
<div id="outline-container-org5a6f0bf" class="outline-3">
<h3 id="org5a6f0bf"><span class="section-number-3">1.2.</span> Medium-Term Scheduling</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Part of the swapping decision, based on memory requirements (memory management) and the
need to manage the degree of multiprogramming.
</p>
</div>
</div>
<div id="outline-container-org105fb29" class="outline-3">
<h3 id="org105fb29"><span class="section-number-3">1.3.</span> Short-Term Scheduling</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Executes most frequently, is invoked whenever an event occurs that may lead to the
blocking of the current process or provides an opportunity to preempt a currently
running process in favour of another.
Such events are:
</p>
<ul class="org-ul">
<li>clock interrupts</li>
<li>IO interrupts</li>
<li>operating system calls</li>
<li>signals (ex. semaphores)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4edd47f" class="outline-2">
<h2 id="org4edd47f"><span class="section-number-2">2.</span> Scheduling Algorithms</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf1cb131" class="outline-3">
<h3 id="orgf1cb131"><span class="section-number-3">2.1.</span> Short-Term Scheduling Criteria</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<b>Objective</b>: allocate processor time to optimize 1+ aspects of system behaviour
</p>

<p>
<b>User-oriented criteria</b> relate to the behaviour of the system as perceived by a user
or process. (ex. response time - time between request submission and response output)
<b>System-oriented criteria</b> have the focus on effective and efficient processor
utilization. (ex. throughput - rate at which processes are completed)
User-oriented criteria always important, system-oriented criteria only important if
more than 1 user.
</p>

<p>
<b>Performance-related criteria</b> are quantitative and can be readily measured (response
time and throughput). <b>Other criteria</b> are qualitative or cannot be readily measured
(predictability).
</p>

<p>
Criteria are interdependent, cannot all be satisfied.
</p>
</div>
<div id="outline-container-org230955f" class="outline-4">
<h4 id="org230955f"><span class="section-number-4">2.1.1.</span> User-Oriented, Performance Related</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
<b>Turnaround time</b>: interval between submission of a process and completion (execution
time plus time spent waiting for resources
</p>

<p>
<b>Response time</b>: time from submission of a request and when the response is received
(request could still be being processed)
</p>

<p>
<b>Deadlines</b>: when process completion deadlines can be specified, scheduling should
maximize the percent of deadlines met
</p>
</div>
</div>
