3A/SE350/Uniprocessor-Scheduling.tex
% Created 2024-03-25 Mon 01:44
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip,darkmode}
\enabledarkmode
\author{Arnav Gupta}
\date{\today}
\title{Uniprocessor Scheduling}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={Uniprocessor Scheduling},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.2 (Org mode 9.7)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Types of Processor Scheduling}
\label{sec:org1e4b5b0}
\textbf{Long-term scheduling}: decision to add to the pool of processes to be executed

\textbf{Medium-term scheduling}: decision to add to the number of processes that are partially or
fully in main memory

\textbf{Short-term scheduling}: decision as to which available process will be executed by the
processor

\textbf{IO scheduling}: decision as to which process's pending IO request shall be handled by an
available IO device

The aim of processor scheduling is to assign processes to be executed by the processor or
processors over time, in a way that meets system objectives (response time, throughput,
processor efficiency).

Scheduling affect system performance since it determines which processes wait and which
progress.
Scheduling involves managing queues to minimize queueing delay and to optimize performance
in a queueing environment.
\subsection{Long-Term Scheduling}
\label{sec:org8b7eb74}
Controls the degree of multiprogramming since it determines which programs are admitted
to the system.

A newly created process can be added to a queue for a short-term scheduler (admitted)
or a medium-term scheduler (swapped-out).

Newly submitted jobs are routed to disk and held in a batch queue, which the long-term
scheduler creates processes from, based on 2 decisions:
\begin{enumerate}
\item when the OS can take on one or more additional processes
\begin{itemize}
\item driven by the desired degree of multiprogramming
\item more processes created, smaller percentage of time each process can be executed
\item each time a job terminates, scheduler may add 1+ jobs
\item if the fraction of idle time exceeds a threshold, scheduler may be invoked
\end{itemize}
\item which job(s) to accept and turn into processes
\begin{itemize}
\item can be based on first-come-first-serve or include priority, expected execution time,
and IO requirements
\end{itemize}
\end{enumerate}

For interactive programs in a time-sharing system, the OS accepts all users until the
system is saturated.
\subsection{Medium-Term Scheduling}
\label{sec:org0c46e28}
Part of the swapping decision, based on memory requirements (memory management) and the
need to manage the degree of multiprogramming.
\subsection{Short-Term Scheduling}
\label{sec:org0dd9ffd}
Executes most frequently, is invoked whenever an event occurs that may lead to the
blocking of the current process or provides an opportunity to preempt a currently
running process in favour of another.
Such events are:
\begin{itemize}
\item clock interrupts
\item IO interrupts
\item operating system calls
\item signals (ex. semaphores)
\end{itemize}
\section{Scheduling Algorithms}
\label{sec:org1e3e68b}
\subsection{Short-Term Scheduling Criteria}
\label{sec:org848978e}
\textbf{Objective}: allocate processor time to optimize 1+ aspects of system behaviour

\textbf{User-oriented criteria} relate to the behaviour of the system as perceived by a user
or process. (ex. response time - time between request submission and response output)
\textbf{System-oriented criteria} have the focus on effective and efficient processor
utilization. (ex. throughput - rate at which processes are completed)
User-oriented criteria always important, system-oriented criteria only important if
more than 1 user.

\textbf{Performance-related criteria} are quantitative and can be readily measured (response
time and throughput). \textbf{Other criteria} are qualitative or cannot be readily measured
(predictability).

Criteria are interdependent, cannot all be satisfied.
\subsubsection{User-Oriented, Performance Related}
\label{sec:orgbf1f197}
\textbf{Turnaround time}: interval between submission of a process and completion (execution
time plus time spent waiting for resources

\textbf{Response time}: time from submission of a request and when the response is received
(request could still be being processed)

\textbf{Deadlines}: when process completion deadlines can be specified, scheduling should
maximize the percent of deadlines met
