3A/SE350/Uniprocessor-Scheduling.org
*** User-Oriented, Other
*Predictability*: a job should run in the same amount of time and cost regardless of
system load

*** System-Oriented, Performance Related
*Throughput*: maximize number of processes completed per unit time (how much work is being
performed)

*Processor utilization*: percent of time the processor is busy

*** System-Oriented, Other
*Fairness*: processes should be treated the same, none starving unless otherwise specified

*Enforcing priorities*: scheduling policy should favour high-priority process

*Balancing resources*: scheduling policy should keep the resources of the system busy

** Use of Priorities
Priority can be implemented with multiple queues in descending order of priority.
Lower-priority processes may suffer starvation, which can be solved by having the priority
of a process change with its age or execution history.

** Alternative Scheduling Policies
*Selection function*: determines which process is selected next for execution, could depend
on priority, resource requirements, or execution characteristics of the process.

- $w$ is the time spent in system so far waiting
- $e$ is the time spent in execution so far
- $s$ is the total service time required by the process including $e$

*Decision mode*: specifies the instants in time when the selection function is exercised:
- *nonpreemptive*: a running process continues to execute until it terminates or blocks
  itself to wait for IO or some OS service
- *preemptive*: the currently running process may be interrupted by the OS, done when a
  new process arrives, when an interrupt occurs that readies a blocked process, or
  on a clock interrupt

Preemptive policies have more overhead but could have better service.
Cost can be kept low with efficient process-switching and large main memory.

*** First-Come-First-Served
As each process becomes ready, it joins the ready queue.
When the current process ceases to execute, the process that has been the queue the
longest is selected for running.

Performs better for long processes than short ones.
Favours processor-bound processes over IO-bound processes.

With priorities, can create an effective scheduler.

*** Round Robin
When an interrupt occurs, the current process is placed in the ready queue and the
next ready job is selected on a FCFS basis.

*Time-slicing*: each process given a slice of time before being preempted

Principle design issue is length of time quantum: very short means too much overhead.
Time quantum should be slightly greater than the time required for a typical
interaction or process funciton.

Particularly effective in a general-purpose time-sharing system or transaction
processing system. Drawback is that processor-bound processes tend to receive an
unfair portion of processor time.

Virtual round robin uses an auxiliary queue for processes that are moved after
being released from an IO block. Processes in the auxiliary queue get preference
over those in the main ready queue. It then runs no longer than a time equal to
the basic time quantum minus the total time spent running since it was last
selected from the main ready queue.

*** Shortest Process Next
Nonpreemptive policy where the process with the shortest expected processing
time is selected next.

Overall performance is improved in terms of response time, though response times
vary more so less predictability.
Further, difficult to know actual required processing time.

For interactive processes, the OS keeps a running average of each burst for
each process. The calculation used is
$$
S_{n+1} = \frac{1}{n} T_{n} + \frac{n-1}{n} S_{n}
$$
where $T_{i}$ is the processor execution time for instance $i$ of the process
(total exec time for batch job, burst time for interactive job) and
$S_{i}$ is the predicted value for instance $i$

Preference is giving weight to more recent instances so *exponential averaging*
is used:
$$
S_{n+1} = \alpha T_{n} + (1 - \alpha) S_{n}
$$
where $\alpha$ is a constant weighting factor. If $\alpha$ close to 1, the
average will quickly reflect a rapid change in the observed quantity.

Exponential averaging tracks changes in process behaviour faster than simple
averaging.

SPN could starve longer processes if enough shorter processes. Though, reduces
bias in favour of longer jobs. Undesirable for certain environments because of
lack of preemption.

