3A/SE350/Uniprocessor-Scheduling.html
<div id="outline-container-orgb430b37" class="outline-4">
<h4 id="orgb430b37"><span class="section-number-4">2.1.2.</span> User-Oriented, Other</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
<b>Predictability</b>: a job should run in the same amount of time and cost regardless of
system load
</p>
</div>
</div>
<div id="outline-container-orgf4bd488" class="outline-4">
<h4 id="orgf4bd488"><span class="section-number-4">2.1.3.</span> System-Oriented, Performance Related</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
<b>Throughput</b>: maximize number of processes completed per unit time (how much work is being
performed)
</p>

<p>
<b>Processor utilization</b>: percent of time the processor is busy
</p>
</div>
</div>
<div id="outline-container-org9ae71d5" class="outline-4">
<h4 id="org9ae71d5"><span class="section-number-4">2.1.4.</span> System-Oriented, Other</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
<b>Fairness</b>: processes should be treated the same, none starving unless otherwise specified
</p>

<p>
<b>Enforcing priorities</b>: scheduling policy should favour high-priority process
</p>

<p>
<b>Balancing resources</b>: scheduling policy should keep the resources of the system busy
</p>
</div>
</div>
</div>
<div id="outline-container-orgf641dcf" class="outline-3">
<h3 id="orgf641dcf"><span class="section-number-3">2.2.</span> Use of Priorities</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Priority can be implemented with multiple queues in descending order of priority.
Lower-priority processes may suffer starvation, which can be solved by having the priority
of a process change with its age or execution history.
</p>
</div>
</div>
<div id="outline-container-org468716d" class="outline-3">
<h3 id="org468716d"><span class="section-number-3">2.3.</span> Alternative Scheduling Policies</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<b>Selection function</b>: determines which process is selected next for execution, could depend
on priority, resource requirements, or execution characteristics of the process.
</p>

<ul class="org-ul">
<li>\(w\) is the time spent in system so far waiting</li>
<li>\(e\) is the time spent in execution so far</li>
<li>\(s\) is the total service time required by the process including \(e\)</li>
</ul>

<p>
<b>Decision mode</b>: specifies the instants in time when the selection function is exercised:
</p>
<ul class="org-ul">
<li><b>nonpreemptive</b>: a running process continues to execute until it terminates or blocks
itself to wait for IO or some OS service</li>
<li><b>preemptive</b>: the currently running process may be interrupted by the OS, done when a
new process arrives, when an interrupt occurs that readies a blocked process, or
on a clock interrupt</li>
</ul>

<p>
Preemptive policies have more overhead but could have better service.
Cost can be kept low with efficient process-switching and large main memory.
</p>
</div>
<div id="outline-container-org8c4c8af" class="outline-4">
<h4 id="org8c4c8af"><span class="section-number-4">2.3.1.</span> First-Come-First-Served</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
As each process becomes ready, it joins the ready queue.
When the current process ceases to execute, the process that has been the queue the
longest is selected for running.
</p>

<p>
Performs better for long processes than short ones.
Favours processor-bound processes over IO-bound processes.
</p>

<p>
With priorities, can create an effective scheduler.
</p>
</div>
</div>
<div id="outline-container-org13b5895" class="outline-4">
<h4 id="org13b5895"><span class="section-number-4">2.3.2.</span> Round Robin</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
When an interrupt occurs, the current process is placed in the ready queue and the
next ready job is selected on a FCFS basis.
</p>

<p>
<b>Time-slicing</b>: each process given a slice of time before being preempted
</p>

<p>
Principle design issue is length of time quantum: very short means too much overhead.
Time quantum should be slightly greater than the time required for a typical
interaction or process funciton.
</p>

<p>
Particularly effective in a general-purpose time-sharing system or transaction
processing system. Drawback is that processor-bound processes tend to receive an
unfair portion of processor time.
</p>

<p>
Virtual round robin uses an auxiliary queue for processes that are moved after
being released from an IO block. Processes in the auxiliary queue get preference
over those in the main ready queue. It then runs no longer than a time equal to
the basic time quantum minus the total time spent running since it was last
selected from the main ready queue.
</p>
</div>
</div>
<div id="outline-container-orga808e86" class="outline-4">
<h4 id="orga808e86"><span class="section-number-4">2.3.3.</span> Shortest Process Next</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
Nonpreemptive policy where the process with the shortest expected processing
time is selected next.
</p>

<p>
Overall performance is improved in terms of response time, though response times
vary more so less predictability.
Further, difficult to know actual required processing time.
</p>

<p>
For interactive processes, the OS keeps a running average of each burst for
each process. The calculation used is
\[
S_{n+1} = \frac{1}{n} T_{n} + \frac{n-1}{n} S_{n}
\]
where \(T_{i}\) is the processor execution time for instance \(i\) of the process
(total exec time for batch job, burst time for interactive job) and
\(S_{i}\) is the predicted value for instance \(i\)
</p>

<p>
Preference is giving weight to more recent instances so <b>exponential averaging</b>
is used:
\[
S_{n+1} = \alpha T_{n} + (1 - \alpha) S_{n}
\]
where \(\alpha\) is a constant weighting factor. If \(\alpha\) close to 1, the
average will quickly reflect a rapid change in the observed quantity.
</p>

<p>
Exponential averaging tracks changes in process behaviour faster than simple
averaging.
</p>

<p>
SPN could starve longer processes if enough shorter processes. Though, reduces
bias in favour of longer jobs. Undesirable for certain environments because of
lack of preemption.
</p>
</div>
</div>
