3A/SE350/Uniprocessor-Scheduling.tex
\subsubsection{User-Oriented, Other}
\label{sec:org8f16e0b}
\textbf{Predictability}: a job should run in the same amount of time and cost regardless of
system load
\subsubsection{System-Oriented, Performance Related}
\label{sec:org59cb16f}
\textbf{Throughput}: maximize number of processes completed per unit time (how much work is being
performed)

\textbf{Processor utilization}: percent of time the processor is busy
\subsubsection{System-Oriented, Other}
\label{sec:orgce117b3}
\textbf{Fairness}: processes should be treated the same, none starving unless otherwise specified

\textbf{Enforcing priorities}: scheduling policy should favour high-priority process

\textbf{Balancing resources}: scheduling policy should keep the resources of the system busy
\subsection{Use of Priorities}
\label{sec:org7498890}
Priority can be implemented with multiple queues in descending order of priority.
Lower-priority processes may suffer starvation, which can be solved by having the priority
of a process change with its age or execution history.
\subsection{Alternative Scheduling Policies}
\label{sec:org67ccf2e}
\textbf{Selection function}: determines which process is selected next for execution, could depend
on priority, resource requirements, or execution characteristics of the process.

\begin{itemize}
\item \(w\) is the time spent in system so far waiting
\item \(e\) is the time spent in execution so far
\item \(s\) is the total service time required by the process including \(e\)
\end{itemize}

\textbf{Decision mode}: specifies the instants in time when the selection function is exercised:
\begin{itemize}
\item \textbf{nonpreemptive}: a running process continues to execute until it terminates or blocks
itself to wait for IO or some OS service
\item \textbf{preemptive}: the currently running process may be interrupted by the OS, done when a
new process arrives, when an interrupt occurs that readies a blocked process, or
on a clock interrupt
\end{itemize}

Preemptive policies have more overhead but could have better service.
Cost can be kept low with efficient process-switching and large main memory.
\subsubsection{First-Come-First-Served}
\label{sec:orgcdfdf07}
As each process becomes ready, it joins the ready queue.
When the current process ceases to execute, the process that has been the queue the
longest is selected for running.

Performs better for long processes than short ones.
Favours processor-bound processes over IO-bound processes.

With priorities, can create an effective scheduler.
\subsubsection{Round Robin}
\label{sec:org4d7a2ac}
When an interrupt occurs, the current process is placed in the ready queue and the
next ready job is selected on a FCFS basis.

\textbf{Time-slicing}: each process given a slice of time before being preempted

Principle design issue is length of time quantum: very short means too much overhead.
Time quantum should be slightly greater than the time required for a typical
interaction or process funciton.

Particularly effective in a general-purpose time-sharing system or transaction
processing system. Drawback is that processor-bound processes tend to receive an
unfair portion of processor time.

Virtual round robin uses an auxiliary queue for processes that are moved after
being released from an IO block. Processes in the auxiliary queue get preference
over those in the main ready queue. It then runs no longer than a time equal to
the basic time quantum minus the total time spent running since it was last
selected from the main ready queue.
\subsubsection{Shortest Process Next}
\label{sec:orgf1c8781}
Nonpreemptive policy where the process with the shortest expected processing
time is selected next.

Overall performance is improved in terms of response time, though response times
vary more so less predictability.
Further, difficult to know actual required processing time.

For interactive processes, the OS keeps a running average of each burst for
each process. The calculation used is
$$
S_{n+1} = \frac{1}{n} T_{n} + \frac{n-1}{n} S_{n}
$$
where \(T_{i}\) is the processor execution time for instance \(i\) of the process
(total exec time for batch job, burst time for interactive job) and
\(S_{i}\) is the predicted value for instance \(i\)

Preference is giving weight to more recent instances so \textbf{exponential averaging}
is used:
$$
S_{n+1} = \alpha T_{n} + (1 - \alpha) S_{n}
$$
where \(\alpha\) is a constant weighting factor. If \(\alpha\) close to 1, the
average will quickly reflect a rapid change in the observed quantity.

Exponential averaging tracks changes in process behaviour faster than simple
averaging.

SPN could starve longer processes if enough shorter processes. Though, reduces
bias in favour of longer jobs. Undesirable for certain environments because of
lack of preemption.
