3A/SE350/Uniprocessor-Scheduling.org
*** Shortest Remaining Time
Scheduler always chooses the process that has the shortest expected remaining processing
time.

Scheduler may preempt the current process when a new process becomes ready. Must have an
estimate of processing time to select, and still a risk of starvation of longer
processes.

Less overhead than round robin since no additional interrupts, though elapsed service
time must be recorded.
Faster turnaround time since shorter jobs can preempt longer ones.

*** Higher Response Ratio Next
Based on the ratio
$$
R = \frac{w + s}{s}
$$
where $R$ is the *response ratio*, $w$ is the time spent waiting for the processor, and
$s$ is the expected service time.

Scheduling rule is that when the current process completes or is blocked, choose the
ready process with the greatest $R$ value (accounts for process age).

Shorter jobs are favoured but longer processes will also eventually get past competing
shorter jobs.

*** Feedback
SPN, SRT, HRRN cannot be used if no indication of relative process length.

Scheduling is preemptive and dynamic priority is used.
Every time a running process is preempted, it is demoted to the next lower-priority
queue.
Within each queue other than the lowest-priority one, FCFS is used, otherwise round
robin used.
Known as *multilevel feedback*.

Turnaround time can stretch out alarmingly. Can cause starvation if new jobs enter
system frequently, can compensate by varying time allowed to execute before
preemption for each queue.
Another remedy is to promote a process to a higher-priority queue after it spends
some time in its current queue.

** Performance Comparison
Relative performance depdends on distribution of service times, efficiency of scheduling
and context switching mechanisms, nature of IO demand, and performance of IO subsystems.

*** Queueing Analysis
Any scheduling discipline that chooses the next item independent of service time obeys
$$
\frac{T_{r}}{T_{s}} = \frac{1}{1 - \rho}
$$
where $T_{r}$ is the turnaround time, $T_{s}$ is the average service time, and $\rho$
is the processor utilization.

For scheduling algorithms that account for service time, compared to FCFS, relative
performance can be found by considering priority scheduling in which priority is
based on service time.

For queues with 2 priority categories, assume:
1. poisson arrival rate
2. priority 1 items are services before priority 2 items
3. FCFS dispatching for items of equal priority
4. no item interrupted while being served
5. no items leave the queue (lost calls delayed)
$\lambda$ is the arrival rate.
The general formulas are:
$$
\lambda = \lambda_{1} + \lambda_{2}
$$
$$
\rho_{1} = \lambda_{1} T_{s1} ; \rho_{2} = \lambda_{2} T_{s2}
$$
$$
\rho = \rho_{1} + \rho_{2}
$$
$$
T_{s} = \frac{\lambda_{1}}{\lambda} T_{s1} + \frac{\lambda_{2}}{\lambda}T_{s2}
$$
$$
T_{r} = \frac{\lambda_{1}}{\lambda} T_{r1} + \frac{\lambda_{2}}{\lambda}T_{r2}
$$
If no interrupts, with exponential service times:
$$
T_{r1} = T_{s1} + \frac{\rho_{1}T_{s1} + \rho_{2}T_{s2}}{1 + \rho_{1}}
$$
$$
T_{r2} = T_{s2} + \frac{T_{r1} - T_{s1}}{1 - \rho}
$$
With preemptive-resume queueing discipline and exponential service times:
$$
T_{r1} = T_{s1} + \frac{\rho_{1}T_{s1}}{1 - \rho_{1}}
$$
$$
T_{r2} = T_{s2} + \frac{1}{1 - \rho_{1}} \left(
\rho_{1} T_{s2} + \frac{\rho T_{s}}{1 - \rho}
\right)
$$

*** Simulation Modelling
Discrete-event simulation allows a wide range of policies to be modelled, but the results
for a given run only apply to that particular collection of processes under a particular
set of assumptions.

Results are presented by grouping processes into service-time percentiles so effects
of policiies can be viewed as a function of process length.

