3A/SE350/Uniprocessor-Scheduling.html
<div id="outline-container-orga2c2a31" class="outline-4">
<h4 id="orga2c2a31"><span class="section-number-4">2.3.4.</span> Shortest Remaining Time</h4>
<div class="outline-text-4" id="text-2-3-4">
<p>
Scheduler always chooses the process that has the shortest expected remaining processing
time.
</p>

<p>
Scheduler may preempt the current process when a new process becomes ready. Must have an
estimate of processing time to select, and still a risk of starvation of longer
processes.
</p>

<p>
Less overhead than round robin since no additional interrupts, though elapsed service
time must be recorded.
Faster turnaround time since shorter jobs can preempt longer ones.
</p>
</div>
</div>
<div id="outline-container-org3b6f1e0" class="outline-4">
<h4 id="org3b6f1e0"><span class="section-number-4">2.3.5.</span> Higher Response Ratio Next</h4>
<div class="outline-text-4" id="text-2-3-5">
<p>
Based on the ratio
\[
R = \frac{w + s}{s}
\]
where \(R\) is the <b>response ratio</b>, \(w\) is the time spent waiting for the processor, and
\(s\) is the expected service time.
</p>

<p>
Scheduling rule is that when the current process completes or is blocked, choose the
ready process with the greatest \(R\) value (accounts for process age).
</p>

<p>
Shorter jobs are favoured but longer processes will also eventually get past competing
shorter jobs.
</p>
</div>
</div>
<div id="outline-container-org3ac0ff5" class="outline-4">
<h4 id="org3ac0ff5"><span class="section-number-4">2.3.6.</span> Feedback</h4>
<div class="outline-text-4" id="text-2-3-6">
<p>
SPN, SRT, HRRN cannot be used if no indication of relative process length.
</p>

<p>
Scheduling is preemptive and dynamic priority is used.
Every time a running process is preempted, it is demoted to the next lower-priority
queue.
Within each queue other than the lowest-priority one, FCFS is used, otherwise round
robin used.
Known as <b>multilevel feedback</b>.
</p>

<p>
Turnaround time can stretch out alarmingly. Can cause starvation if new jobs enter
system frequently, can compensate by varying time allowed to execute before
preemption for each queue.
Another remedy is to promote a process to a higher-priority queue after it spends
some time in its current queue.
</p>
</div>
</div>
</div>
<div id="outline-container-orgef419cb" class="outline-3">
<h3 id="orgef419cb"><span class="section-number-3">2.4.</span> Performance Comparison</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Relative performance depdends on distribution of service times, efficiency of scheduling
and context switching mechanisms, nature of IO demand, and performance of IO subsystems.
</p>
</div>
<div id="outline-container-orgc4f1b0c" class="outline-4">
<h4 id="orgc4f1b0c"><span class="section-number-4">2.4.1.</span> Queueing Analysis</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
Any scheduling discipline that chooses the next item independent of service time obeys
\[
\frac{T_{r}}{T_{s}} = \frac{1}{1 - \rho}
\]
where \(T_{r}\) is the turnaround time, \(T_{s}\) is the average service time, and \(\rho\)
is the processor utilization.
</p>

<p>
For scheduling algorithms that account for service time, compared to FCFS, relative
performance can be found by considering priority scheduling in which priority is
based on service time.
</p>

<p>
For queues with 2 priority categories, assume:
</p>
<ol class="org-ol">
<li>poisson arrival rate</li>
<li>priority 1 items are services before priority 2 items</li>
<li>FCFS dispatching for items of equal priority</li>
<li>no item interrupted while being served</li>
<li>no items leave the queue (lost calls delayed)</li>
</ol>
<p>
\(\lambda\) is the arrival rate.
The general formulas are:
\[
\lambda = \lambda_{1} + \lambda_{2}
\]
\[
\rho_{1} = \lambda_{1} T_{s1} ; \rho_{2} = \lambda_{2} T_{s2}
\]
\[
\rho = \rho_{1} + \rho_{2}
\]
\[
T_{s} = \frac{\lambda_{1}}{\lambda} T_{s1} + \frac{\lambda_{2}}{\lambda}T_{s2}
\]
\[
T_{r} = \frac{\lambda_{1}}{\lambda} T_{r1} + \frac{\lambda_{2}}{\lambda}T_{r2}
\]
If no interrupts, with exponential service times:
\[
T_{r1} = T_{s1} + \frac{\rho_{1}T_{s1} + \rho_{2}T_{s2}}{1 + \rho_{1}}
\]
\[
T_{r2} = T_{s2} + \frac{T_{r1} - T_{s1}}{1 - \rho}
\]
With preemptive-resume queueing discipline and exponential service times:
\[
T_{r1} = T_{s1} + \frac{\rho_{1}T_{s1}}{1 - \rho_{1}}
\]
\[
T_{r2} = T_{s2} + \frac{1}{1 - \rho_{1}} \left(
\rho_{1} T_{s2} + \frac{\rho T_{s}}{1 - \rho}
\right)
\]
</p>
</div>
</div>
<div id="outline-container-org2337b17" class="outline-4">
<h4 id="org2337b17"><span class="section-number-4">2.4.2.</span> Simulation Modelling</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
Discrete-event simulation allows a wide range of policies to be modelled, but the results
for a given run only apply to that particular collection of processes under a particular
set of assumptions.
</p>

<p>
Results are presented by grouping processes into service-time percentiles so effects
of policiies can be viewed as a function of process length.
</p>
</div>
</div>
</div>
