3A/SE350/Uniprocessor-Scheduling.html
<div id="outline-container-org5f84b59" class="outline-3">
<h3 id="org5f84b59"><span class="section-number-3">2.5.</span> Fair-Share Scheduling</h3>
<div class="outline-text-3" id="text-2-5">
<p>
In a multiuser system, it is attractive to make scheduling decisions based on sets of processes
that compose an application which is <b>fair-share scheduling</b>.
Similar for time-sharing systems, except with groups of users.
</p>

<p>
Each user assigned a weighting of some sort that defines the user&rsquo;s share of system
resources as a fraction of total resource usage (a share of the processor).
</p>

<p>
The fair-share scheduler considers the execution history of a related group of processes
and each process&rsquo;s execution history to make scheduling decisions.
The system divides users into groups and allocates each group some processor.
</p>

<p>
Scheduling done on the basis of priority and accounts for the underlying priority of the
process, its recent processor usage, and the recent processor usage of the group to which
the process belongs.
For a process \(j\) in group \(k\):
\[
CPU_{j}(i) = \frac{CPU_{j}(i-1)}{2}
\]
\[
GCPU_{k}(i) = \frac{GCPU_{k}(i-1)}{2}
\]
\[
P_{j}(i) = Base_{j} + \frac{CPU_{j}(i)}{2} + \frac{GCPU_{k}(i)}{4 \times W_{k}}
\]
where \(CPU_{j}(i)\) is the processor utilization by process \(j\) through interval \(i\),
\(GCPU_{k}(i)\) is the processor utilization of group \(k\) through interval \(i\),
\(P_{j}(i)\) is the priority of process \(j\) at the beginning of interval \(i\) (lower value
is higher priority),
\(Base_{j}\) is the base priority of process \(j\),
and \(W_{k}\) is the weighting assigned to group \(k\).
</p>

<p>
Each process has a base priority that drops as the process uses the processor and the group
uses the processor.
Greater the weight assigned to the group, the less its utilization affects its priority.
</p>
</div>
</div>
</div>
<div id="outline-container-orgab57794" class="outline-2">
<h2 id="orgab57794"><span class="section-number-2">3.</span> Traditional UNIX Scheduling</h2>
<div class="outline-text-2" id="text-3">
<p>
Primarily for time-sharing interactive environments, to provide good response time for
interactive users while ensuring low-priority background jobs do not starve.
</p>

<p>
Uses multilevel feedback using round robin within each priority queue.
System uses 1 second preemption, so if a running process does not block or complete within
1 second, it is preempted.
Priority based on process type and execution history with the following formulas:
\[
CPU_{j}(i) = \frac{CPU_{j}(i-1)}{2}
\]
\[
P_{j}(i) = Base_{j} + \frac{CPU_{j}(i)}{2} + nice_{j}
\]
where \(nice\) is a user-controllable adjustment factor.
</p>

<p>
Priority of each process recomputed once per second.
Band priority divides all processes into fixed bands of priority levels.
\(CPU\) and \(nice\) are restricted to prevent a process from migrating out of assigned band.
In decreasing order of priority, bands are:
</p>
<ul class="org-ul">
<li>swapper</li>
<li>block IO device control</li>
<li>file manipulation</li>
<li>character IO device control</li>
<li>user processes</li>
</ul>
<p>
Provides most efficient use of IO devices.
For user-processes band, execution history penalizes processor-bound processes, improving
efficiency.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-03-25 Mon 01:44</p>
</div>
</body>
</html>
