3A/SE350/Uniprocessor-Scheduling.tex
\subsection{Fair-Share Scheduling}
\label{sec:orgbcfe6af}
In a multiuser system, it is attractive to make scheduling decisions based on sets of processes
that compose an application which is \textbf{fair-share scheduling}.
Similar for time-sharing systems, except with groups of users.

Each user assigned a weighting of some sort that defines the user's share of system
resources as a fraction of total resource usage (a share of the processor).

The fair-share scheduler considers the execution history of a related group of processes
and each process's execution history to make scheduling decisions.
The system divides users into groups and allocates each group some processor.

Scheduling done on the basis of priority and accounts for the underlying priority of the
process, its recent processor usage, and the recent processor usage of the group to which
the process belongs.
For a process \(j\) in group \(k\):
$$
CPU_{j}(i) = \frac{CPU_{j}(i-1)}{2}
$$
$$
GCPU_{k}(i) = \frac{GCPU_{k}(i-1)}{2}
$$
$$
P_{j}(i) = Base_{j} + \frac{CPU_{j}(i)}{2} + \frac{GCPU_{k}(i)}{4 \times W_{k}}
$$
where \(CPU_{j}(i)\) is the processor utilization by process \(j\) through interval \(i\),
\(GCPU_{k}(i)\) is the processor utilization of group \(k\) through interval \(i\),
\(P_{j}(i)\) is the priority of process \(j\) at the beginning of interval \(i\) (lower value
is higher priority),
\(Base_{j}\) is the base priority of process \(j\),
and \(W_{k}\) is the weighting assigned to group \(k\).

Each process has a base priority that drops as the process uses the processor and the group
uses the processor.
Greater the weight assigned to the group, the less its utilization affects its priority.
\section{Traditional UNIX Scheduling}
\label{sec:org114db5f}
Primarily for time-sharing interactive environments, to provide good response time for
interactive users while ensuring low-priority background jobs do not starve.

Uses multilevel feedback using round robin within each priority queue.
System uses 1 second preemption, so if a running process does not block or complete within
1 second, it is preempted.
Priority based on process type and execution history with the following formulas:
$$
CPU_{j}(i) = \frac{CPU_{j}(i-1)}{2}
$$
$$
P_{j}(i) = Base_{j} + \frac{CPU_{j}(i)}{2} + nice_{j}
$$
where \(nice\) is a user-controllable adjustment factor.

Priority of each process recomputed once per second.
Band priority divides all processes into fixed bands of priority levels.
\(CPU\) and \(nice\) are restricted to prevent a process from migrating out of assigned band.
In decreasing order of priority, bands are:
\begin{itemize}
\item swapper
\item block IO device control
\item file manipulation
\item character IO device control
\item user processes
\end{itemize}
Provides most efficient use of IO devices.
For user-processes band, execution history penalizes processor-bound processes, improving
efficiency.
\end{document}
